Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.EnergyModelType
It indicates whether the energy model is based on rooms/spaces or building elements.
Remarks:
The default value is EnergyModelType::SpatialElement.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016